Revit 2024 API
ExportLineweightTable.GetValues Method
 Returns all the values stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<ExportLineweightInfo> GetValues()
Visual Basic
Public Function GetValues As IList(Of ExportLineweightInfo)
Visual C++
public:
IList<ExportLineweightInfo^>^ GetValues()
Return Value
 The info.
See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace